#include <iostream>
using namespace std;

int main()
{
    //Реализовать все функции в Main

    return 0;
}
void initInt()
{
    //Объявить переменную типа int
    //Объявить и инициализировать переменную типа int (двумя способами)
    //Объявить и инициализировать переменную типа int путем получения значения с клавиатуры

}
void initChar() 
{
    //Объявить переменную типа char
    //Объявить и инициализировать переменную типа char (двумя способами)
}
void unsignedDigit()
{
    //Объявить и инициализировать переменную типа unsigned int (двумя способами)
}
void initMassive() 
{
    // создать и заполнить массив  - тип int, размер 10 нулями
    // создать и заполнить массив  - тип int, размер 10 нулями, единицами, двойками и т.д.
    //создать и инициализировать массив - тип int, размер 10 нулями, единицами, двойками и т.д. через константы в качестве размерности
    //создать и инициализировать массив - тип int, размер 10 нулями, единицами, двойками и т.д. динамически

}
void viewMassive()
{
   // создать массив и вывести его на экран. Входные параметры - длина массива в int.
}
int sum(int a, int b) 
{
    int  x = 0;
    //написать функцию Суммы. На входе два числа типа int, возвращаемое знчение типа int
    return x;
}
float devide()
{
    float x = 0;
    //написать функцию деления чисел с приведением к типу float
    return x;
}
void ifElse()
{
    //написать программу для сравнения вводимого числа с 5 с выводом результата на экран
    // - путем If - Else
    // - путем switch - case
}
void WhileDo()
{
    //вывести через знак табуляции ряд 10 случайных чисел. На входе массив int из 10 элементов
}
void TwiceFor()
{
    //создать двумерный массив 10 на 10 и заполниить его числами от 0 до 9, увиеличивая значение на 1 для каждой новой строчки
    //вывести указанный массив на экран. 
}
void search()
{
//создать функцию - шаблон для поиска в int/float/char массиве из 10 элементов целого / дробного  числа или символа. 
}


